<script setup>
import HeaderComponent from "../src/components/HeaderComponent.vue";
import MainComponent from "../src/components/MainComponent.vue";

alert('Прошу прочитать мои комментарии в App.vue')

/*
  Здравствуйте, первым делом хочу рассказать за бутстрап. Я читал ваши стандарты вёрстки, и к данному макету я без понятия, как сюда можно прикрепить 
  бутстрап чтобы это имело смысл. По факту это было бы минимальное использование бутстрапа и дальше мои стили 
  из-за чего бы нарушилось понимание проекта, ибо читать и понимать это стало на порядок сложнее (как мне 
  кажется), да и смысла от такого бутстрапа не много. В общем я решил не усложнять проект наличием 
  CSS-фреймворка и показать свою вёрстку (чем не горжусь, ибо много чего есть исправлять, просто время не 
  рассчитал и немного не успел). 

Ещё хочу отметить момент с марсом и заголовком. Если раскомментировать в MainComponent.vue компонент 
MarsComponent и представить что у нас нет адаптива (то есть верстка будет на экране ноутбука (по крайнеймере 
моего)), то всё ок: текст немного заходит за нашу планету как это показано на макете. Более подробно могу все 
объяснить на собеседовании, куда очень хочу попасть, ибо в данном задании не смог себя реализовать и впечатление 
обо мне от такого выполнения задания может сойти на нет. Все таки я себя больше позиционирую как фронтенд 
программиста, а не верстальщика, в том плане что больше работаю с js и Vue. Мне это больше нравится и тут 
больше места для развития, а знания более ценные.

Последнее объяснение касается навигации для мобильных устройств. Не стал делать бургер по двум причинам: в 
правилах сказано, что если можно не использовать js - лучше не использовать, а также (как по мне) смотрелось бы
не лучше. 

Ещё раз скажу, что хочу попасть на собеседование и там доказать свои знания и умения в первую очередь в 
программировании. Очень хочу устроиться работать именно в офис, потому что, как мне кажется, так качество моей 
работы для работодателя будет выше, а обучаемость (что тоже будет влиять на качество работы) лучше.

А еще случилось так что я неправильно ввел команды гита и весь мой проект слетел до адаптива и мне 
все пришлось переделывать :(. Так как время поджимает, а я человек пунктуальный мне пришлось написать это все за 4 
часа чтобы успеть по срокам. Из-за столь неприятного инцедента что-то может быть еще хуже чем в прошлый раз,
но надеюсь вам понравится :)
*/

</script>

<template>
  <div class="wrap">
    <HeaderComponent />
    <MainComponent />
  </div>
</template>

<style lang="scss">
@import "./_global_reset.css";

body {
  overflow: hidden;
}

.wrap {
  width: 100%;
  height: 100vh;


  font-family: 'Roboto', sans-serif;
  
  // background: url(../src/assets/img/background.jpg) 0 0/100% auto no-repeat;;
  background-image: url(../src/assets/img/background.jpg);
  background-repeat: no-repeat;
  background-size: cover;
  background-position: center top;
}


</style>
